In [2]:
import pandas as pd

In [3]:
df1 = pd.read_excel(r"C:\Users\EJ312WS\Downloads\2_Normal (2).mat\india1.xlsx")

In [4]:
df1

   India    IT   Sales   Consulting  Marketing  Analytics      HR
0   2019  25794   42521       34545      33205       57094  62421
1   2020  34624   54975       41334      20622       54163  52061
2   2021  53689   56324       35731      57272       48754  25300
3   2022  40946   55695       23132      33509       60307  43425

In [5]:
df2 = pd.read_excel(r"C:\Users\EJ312WS\Downloads\2_Normal (2).mat\Aus.xlsx")

In [6]:
df2

   Australia  Sales   Consulting  Marketing     IT     HR  Analytics
0       2019   50531       44947      44608  44560  50166       48602
1       2020   43852       52536      42581  43176  52295       49718
2       2021   43561       53553      45424  47747  50556       46786
3       2022   51259       52231      41612  53139  47280       52262

In [7]:
df3 = pd.read_excel(r"C:\Users\EJ312WS\Downloads\2_Normal (2).mat\US.xlsx")

In [8]:
df3

   U.S.  Analytics      HR  Sales   Consulting    IT   Marketing
0  2019       60248  38258   42831       44951  52595      37172
1  2020       60450  27917   57307       47618  40532      47807
2  2021       27556  46353   62251       32065  26254      45267
3  2022       27217  40270   51181       54078  37063      36649

In [9]:
df4= pd.read_excel(r"C:\Users\EJ312WS\Downloads\2_Normal (2).mat\UK.xlsx")

In [10]:
df4

   U.K.  Sales   Consulting    IT   Marketing  Analytics      HR
0  2019   55013       56435  48127      33731       49505  48155
1  2020   26433       32054  53783      20278       27153  39610
2  2021   46486       53026  36475      28475       44470  52824
3  2022   59865       20948  58664      54991       33679  33446

In [11]:
max_salary_2020_ind = df1[df1['India'] == 2020]['Analytics '].max()
max_salary_2020_aus = df2[df2['Australia'] == 2020]['Analytics '].max()
max_salary_2020_us = df3[df3['U.S.'] == 2020]['Analytics '].max()
max_salary_2020_uk = df4[df4['U.K.'] == 2020]['Analytics '].max()

In [12]:
max_salary_2020_ind, max_salary_2020_aus, max_salary_2020_us, max_salary_2020_uk

(54163, 49718, 60450, 27153)

# 1.1. Maximum salary in 2020 for analytics section

In [49]:
import numpy as np

max_salary_2020 = np.amax([max_salary_2020_ind, max_salary_2020_aus, max_salary_2020_us, max_salary_2020_uk])
print(max_salary_2020)

60450

# 1.2. Avg salary in 2020 for analytics section

In [51]:
average_salary_ind = df1['Analytics '].mean()
average_salary_aus = df2['Analytics '].mean()
average_salary_us = df3['Analytics '].mean()
average_salary_uk = df4['Analytics '].mean()

In [53]:
average_salary_ind, average_salary_aus, average_salary_us, average_salary_uk

(55079.5, 49342.0, 43867.75, 38701.75)

In [54]:
avg_salary = np.mean([average_salary_ind, average_salary_aus, average_salary_us, average_salary_uk])

In [55]:
avg_salary

46747.75

# 1.3. Difference between max salary and avg salary for analytics section

In [56]:
difference = max_salary_2020 - avg_salary

In [57]:
difference

13702.25

# 2.1 Maximum salary in 2020 for marketing section

In [59]:
max_salary_2020_ind = df1[df1['India'] == 2020]['Marketing'].max()
max_salary_2020_aus = df2[df2['Australia'] == 2020]['Marketing'].max()
max_salary_2020_us = df3[df3['U.S.'] == 2020]['Marketing'].max()
max_salary_2020_uk = df4[df4['U.K.'] == 2020]['Marketing'].max()

In [60]:
max_salary_2020_ind, max_salary_2020_aus, max_salary_2020_us, max_salary_2020_uk

(20622, 42581, 47807, 20278)

In [61]:
import numpy as np

max_salary_2020 = np.amax([max_salary_2020_ind, max_salary_2020_aus, max_salary_2020_us, max_salary_2020_uk])
print(max_salary_2020)

47807

# 2.2 Avg salary in 2020 for marketing section

In [62]:
average_salary_ind = df1['Marketing'].mean()
average_salary_aus = df2['Marketing'].mean()
average_salary_us = df3['Marketing'].mean()
average_salary_uk = df4['Marketing'].mean()

In [63]:
average_salary_ind, average_salary_aus, average_salary_us, average_salary_uk

(36152.0, 43556.25, 41723.75, 34368.75)

In [64]:
avg_salary = np.mean([average_salary_ind, average_salary_aus, average_salary_us, average_salary_uk])

In [65]:
avg_salary

38950.1875

# 2.3 Difference between max salary and avg salary for marketing section

In [66]:
difference = max_salary_2020 - avg_salary
print(difference)

8856.8125

# 3.1 Maximum salary in 2019 for Sales section

In [15]:
max_salary_2019_ind = df1[df1['India'] == 2019]['Sales '].max()
max_salary_2019_aus = df2[df2['Australia'] == 2019]['Sales '].max()
max_salary_2019_us = df3[df3['U.S.'] == 2019]['Sales '].max()
max_salary_2019_uk = df4[df4['U.K.'] == 2019]['Sales '].max()

In [16]:
max_salary_2019_ind, max_salary_2019_aus, max_salary_2019_us, max_salary_2019_uk

(42521, 50531, 42831, 55013)

In [17]:
import numpy as np

max_salary_2019 = np.amax([max_salary_2019_ind, max_salary_2019_aus, max_salary_2019_us, max_salary_2019_uk])
print(max_salary_2019)

55013

# 3.2 Avg salary in 2020 for Sales section

In [73]:
average_salary_ind = df1['Sales '].mean()
average_salary_aus = df2['Sales '].mean()
average_salary_us = df3['Sales '].mean()
average_salary_uk = df4['Sales '].mean()

In [74]:
average_salary_ind, average_salary_aus, average_salary_us, average_salary_uk

(52378.75, 47300.75, 53392.5, 46949.25)

In [76]:
avg_salary = np.mean([average_salary_ind, average_salary_aus, average_salary_us, average_salary_uk])
avg_salary

50005.3125

# 3.3 Difference between max salary and avg salary for sales section

In [77]:
difference = max_salary_2020 - avg_salary
print(difference)

7301.6875